# Option

## Description
Option return TRUE if the Option key (Mac) or Alt key (Windows) was depressed during the last user event. This function operates with the MouseDown, KeyDown, AutoKey, GetPt, GetPtL, GetLine, and GetRect calls.

```pascal
FUNCTION Option : BOOLEAN;
```

```python

def vs.Option():
    return BOOLEAN
```

## See Also
VS Functions:
MouseDown| KeyDown| AutoKey

## Version
Availability: from MiniCAD
## Category
* User Interactive